/**
 * 定义校验规则文件
 */
(function ($) {

	/**
	 * 提示信息编号
	 */
	$.messages = {
		'1000' : '请输入用户名', '1001' : '请输入登录密码', '1002' : '两次密码不一致', '1003' : '请输入手机号', '1004' : '请输入验证码',
		'1005' : '请输入真实姓名', '1006' : '请输入常用邮箱', '1007' : '请输入职位', '1008' : '职位最多输入50字符', '1009' : '请输入公司名称', 
		'1010' : '公司名称最多输入50字符', '1011' : '请输入身份证号码', '1012' : '请上传您的名片', '1013' : '请上传您的身份证图片',
		'1014' : '请输入您的资产量或年均收入', '1015' : '请输入机构名称', '1016' : '输入长度最大为20', '1017' : '请输入机构净资产',
		'1018' : '长度过长', '1019' : '机构责任人名称必须为中文', '1020' : '请输入机构责任人名称', '1021' : '请输入机构负责人手机号码',
		'1022' : '请输入机构负责人正确手机号', '1023' : '机构负责人手机号已经被注册过',	'1024' : '请输入机构负责人常用邮箱',
		'1025' : '请输入正确邮箱', '1026' : '请输入机构负责人职位', '1027' : '请上传机构负责人名片', '1028' : '请上传机构营业执照',
		'1029' : '请输入原始密码', '1030' : '请输入新密码', '1031' : '请输入注册邮箱', '1032' : '请输入用户名/手机号'
	};
	
})(jQuery);